google-coral/coralmicro/arduino/boards.txt
valiant.name=Valiant
valiant.build.core=arduino
valiant.build.crossprefix=arm-none-eabi-
valiant.build.compiler_path={runtime.tools.arm-none-eabi-gcc.path}/bin/

valiant.build.variant=VALIANT
valiant.build.mcu=cortex-m7
valiant.build.fpu=fpv5-d16
valiant.build.float-abi=hard
valiant.build.extra_flags=
valiant.build.architecture=cortex-m7
valiant.build.board=VALIANT_FREERTOS
valiant.build.ldscript=linker_script.ld
valiant.lib.freertos="{build.variant.path}/libs/liblibs_arduino_bundled.a"
valiant.lib.freertos.arch.define=
valiant.lib.freertos.defines={build.variant.path}/defines.txt
valiant.lib.freertos.ldflags={build.variant.path}/ldflags.txt
valiant.lib.freertos.cflags={build.variant.path}/cflags.txt
valiant.lib.freertos.cxxflags={build.variant.path}/cxxflags.txt
valiant.lib.freertos.includes={build.variant.path}/includes.txt
valiant.lib.freertos.extra_ldflags=

valiant.bootloader.file={runtime.platform.path}/bootloaders/VALIANT/image.srec

valiant.upload.tool=flashtool
valiant.upload.protocol=
valiant.upload.pattern={cmd.path} --elfloader_path {bootloader.file} --app . --ram --elf_path {build.path}/{build.project_name}.elf --strip --toolchain {build.compiler_path}
